---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.OverrideFabricationPartFailed
source: html/af28b65a-fb46-4804-ac09-a04e6c7f1aab.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.OverrideFabricationPartFailed Property

The fabrication part cannot be overridden. The button code you specified does not match the fabrication service. Please specify a different button code or check the fabrication service and try again.

## Syntax (C#)
```csharp
public static FailureDefinitionId OverrideFabricationPartFailed { get; }
```